---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOutGenWarn
source: html/6dafb573-1298-d35c-d6ab-f1afc685be8f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOutGenWarn Property

Can't cut instance(s) of [Symbol] out of its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCutInstanceOutGenWarn { get; }
```